# Task 1
# Напишіть калькулятор в якого будуть реалізовані операції додавання, віднімання, множення, ділення,
# піднесення в степінь, взяття з під кореня, пошук відсотку від числа
# калькулятор працює в нескінченному циклі. На кожній ітерації запитує перше число, операцію,
# друге число, після чого робить певну операцію з цими числами
#
# Огорніть в конструкцію try... except... потенційно "небезпечні" місця, наприклад отримання числа і приведення
# до типу даних або інструкції математичних операцій (ділення на нуль, наприклад)
#
# заповніть ваш скрипт логами
# Логи здебільшого інформаційні (викликали таку функцію з такими аргументами)
# + логи з помилками
# причому логи повинні записуватись у файл, тому що в консолі ви будете взаємодіяти з калькулятором,
# лог файл завжди відкривається в режимі дозапису.
# так як ви працюєте з файлом не забудьте про те що це потенційне місце поломки
